In [1]:
import pandas as pd
import numpy as np

In [2]:
df4 = pd.DataFrame(np.random.randn(6,4),index = ['a','c','e','g','i','j'],columns = ["one","Two","three","four"],)
df4

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
c  0.284473 -0.105120  0.606443  1.933505
e -1.868482  0.856232 -1.268392 -1.784590
g -0.389081  0.173858 -1.658579  0.570900
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [3]:
df4 = df4.reindex(['a','b','c','d','e','f','g','h','i','j'])

df4

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b       NaN       NaN       NaN       NaN
c  0.284473 -0.105120  0.606443  1.933505
d       NaN       NaN       NaN       NaN
e -1.868482  0.856232 -1.268392 -1.784590
f       NaN       NaN       NaN       NaN
g -0.389081  0.173858 -1.658579  0.570900
h       NaN       NaN       NaN       NaN
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [4]:
df4.isnull().sum()

one      4
Two      4
three    4
four     4
dtype: int64

Ignore the tuple :- if we have max number of null valuse we can ignore the tuple.

           by droping the null values .

           syntax :- df.dropna()

In [5]:
d=df4.dropna()
d

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
c  0.284473 -0.105120  0.606443  1.933505
e -1.868482  0.856232 -1.268392 -1.784590
g -0.389081  0.173858 -1.658579  0.570900
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [6]:
d.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

back word and forword filling :- 

              we can fill the missing values with previous value as well as backword value.

In [7]:
df4  # original data set

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b       NaN       NaN       NaN       NaN
c  0.284473 -0.105120  0.606443  1.933505
d       NaN       NaN       NaN       NaN
e -1.868482  0.856232 -1.268392 -1.784590
f       NaN       NaN       NaN       NaN
g -0.389081  0.173858 -1.658579  0.570900
h       NaN       NaN       NaN       NaN
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [8]:
df4.isnull().sum()

one      4
Two      4
three    4
four     4
dtype: int64

In [9]:
f=df4.ffill() # previouse value
f

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b  0.303722 -0.384010 -1.197216  0.031934
c  0.284473 -0.105120  0.606443  1.933505
d  0.284473 -0.105120  0.606443  1.933505
e -1.868482  0.856232 -1.268392 -1.784590
f -1.868482  0.856232 -1.268392 -1.784590
g -0.389081  0.173858 -1.658579  0.570900
h -0.389081  0.173858 -1.658579  0.570900
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [10]:
f.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

In [11]:
b=df4.bfill() # backword value
b

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b  0.284473 -0.105120  0.606443  1.933505
c  0.284473 -0.105120  0.606443  1.933505
d -1.868482  0.856232 -1.268392 -1.784590
e -1.868482  0.856232 -1.268392 -1.784590
f -0.389081  0.173858 -1.658579  0.570900
g -0.389081  0.173858 -1.658579  0.570900
h -0.901514 -1.256472  1.211077 -0.450089
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [12]:
b.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

Filling the missing values global constant :-

                     fill the values with global constant
                     .

               syntax :- dataset.fillna()

In [13]:
df = df4.fillna("7")   # filling null values with 7
df

        one       Two     three      four
a  0.303722  -0.38401 -1.197216  0.031934
b         7         7         7         7
c  0.284473  -0.10512  0.606443  1.933505
d         7         7         7         7
e -1.868482  0.856232 -1.268392  -1.78459
f         7         7         7         7
g -0.389081  0.173858 -1.658579    0.5709
h         7         7         7         7
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [14]:
df.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

interpolate :- 
       
       
     we guess the middle value between two values.

In [15]:
newdata= df4.interpolate()
newdata

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b  0.294098 -0.244565 -0.295387  0.982720
c  0.284473 -0.105120  0.606443  1.933505
d -0.792005  0.375556 -0.330975  0.074457
e -1.868482  0.856232 -1.268392 -1.784590
f -1.128781  0.515045 -1.463485 -0.606845
g -0.389081  0.173858 -1.658579  0.570900
h -0.645298 -0.541307 -0.223751  0.060405
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [16]:
newdata.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

Fill with mean :-
            
             fill the missing values with mean.

In [17]:
dataset=(np.mean(df4))   # this is the mean of the given dataset
dataset

one     -0.694101
Two     -0.205170
three   -0.511013
four     0.174515
dtype: float64

In [18]:
M=df4.fillna(np.mean(df4)) #fill the missing values with mean.
M

        one       Two     three      four
a  0.303722 -0.384010 -1.197216  0.031934
b -0.694101 -0.205170 -0.511013  0.174515
c  0.284473 -0.105120  0.606443  1.933505
d -0.694101 -0.205170 -0.511013  0.174515
e -1.868482  0.856232 -1.268392 -1.784590
f -0.694101 -0.205170 -0.511013  0.174515
g -0.389081  0.173858 -1.658579  0.570900
h -0.694101 -0.205170 -0.511013  0.174515
i -0.901514 -1.256472  1.211077 -0.450089
j -1.593723 -0.515508 -0.759408  0.745431

In [19]:
M=df4.isnull().sum()
M

one      4
Two      4
three    4
four     4
dtype: int64

Fill the missing value with median :-

In [20]:
df5=df4.fillna(df4["Two"].median)
df5.isnull().sum()

one      0
Two      0
three    0
four     0
dtype: int64

In [ ]:
Replacing with most frequent values :-

In [21]:
df4.isnull().sum()

one      4
Two      4
three    4
four     4
dtype: int64

In [22]:
df4['one'].value_counts()  # hence all occur one time so hence no replacing.

-0.901514    1
-1.868482    1
-0.389081    1
-1.593723    1
 0.303722    1
 0.284473    1
Name: one, dtype: int64